#-*- coding: UTF-8 -*-
__author__ = 'yuyang'

G7ResultDic = {

    0     : "",
    10001 : "ipa包备份失败, BundleID不合法!!!",
    10002 : "ipa包备份失败, 备份过程中发生错误!!!",
    10003 : "ipa包提交蒲公英失败并且停止发送邮件，备份成功!!!",
    10004 : "发送邮件失败，可能存在邮件地址错误或者邮件发送配置出错的情况，但是提交蒲公英并且备份成功!!!",
    10005 : "ipa包提交蒲公英成功，但未发送邮件!!!",
    10006 : "请提交搞趣开发平台的用户ID",
    10007 : "提交的用户ID对应的用户不存在",
    10008 : "请填写该用户所拥有的蒲公英uKey和apiKey",
    10009 : "ErrorCode10009",
    10010 : "ErrorCode10010",
    10011 : "ErrorCode10011",
    10012 : "ErrorCode10012",
    10013 : "ErrorCode10013",
	10014 : "ErrorCode10014",
	10015 : "ErrorCode10015",
    10016 : "ErrorCode10016",
    10017 : "ErrorCode10017",
    10018 : "ErrorCode10018",
    10019 : "ErrorCode10019",
    10020 : "ErrorCode10020",
    10021 : "ErrorCode10021",
    10022 : "ErrorCode10022",
}